package homework2.exercises;

public class Exercise3 {

// Задача 3: Да се изведат на екрана всички нечетни числа от -10 до 10
    public static void runExercise3() {
        for (int counter =-9; counter <= 9; counter+=2) {
            System.out.println(counter);
        }
    }
}
