package homework2.exercises;

public class Exercise4 {

    // Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен ред.
    public static void runExercise4() {
        for (int counter = 10; counter >= 1; counter--) {
            System.out.println(counter);
        }
    }
}
